app/Models/User_model.php

    public function user_add($data) {
        $query = $this->db->table($this->table)->insert($data);
---
INSERT INTO `users` (`firstname`, `lastname`, `email`, `mobile`, `username`, `password`) VALUES ('BASIL', 'PATHICKAL', 'basileldo@gmail.com', '07733989214', 'basil', 'vbgdgf')

    public function user_update($where, $data) {
        $this->db->table($this->table)->update($data, $where);
---
UPDATE `users` SET `firstname` = 'Hadin1', `lastname` = 'Basil1', `email` = 'basileldo8888@gmail.com1', `mobile` = '077339892141', `username` = 'hadin1', `password` = 'hadinbasil1'
WHERE `user_id` = '3'